[Survived] Linq method mutation (First() to FirstOrDefault())
Scoreboard.cs:19:33
                 Scores.Add(new StudentScore(student, score));
                 return;
             }
-            var existingScore = Scores.First(_ => _.Student.Equals(student));
+            var existingScore = Scores.FirstOrDefault(_ => _.Student.Equals(student));
             existingScore.AddScore(score);
         }
