[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Scoreboard.cs:14:17
         // inspired by AddItem method in https://github.com/dotnet-architecture/eShopOnWeb/blob/master/src/ApplicationCore/Entities/BasketAggregate/Basket.cs
         public void AddScore(Student student, int score)
         {
-            if (!Scores.Any(_ => _.Student.Equals(student)))
+            if (Scores.Any(_ => _.Student.Equals(student)))
             {
                 Scores.Add(new StudentScore(student, score));

[Killed] Linq method mutation (Any() to All())
Scoreboard.cs:14:18
         // inspired by AddItem method in https://github.com/dotnet-architecture/eShopOnWeb/blob/master/src/ApplicationCore/Entities/BasketAggregate/Basket.cs
         public void AddScore(Student student, int score)
         {
-            if (!Scores.Any(_ => _.Student.Equals(student)))
+            if (!Scores.All(_ => _.Student.Equals(student)))
             {
                 Scores.Add(new StudentScore(student, score));

[Survived] Linq method mutation (FirstOrDefault() to First())
Scoreboard.cs:19:33
                 Scores.Add(new StudentScore(student, score));
                 return;
             }
-            var existingScore = Scores.FirstOrDefault(_ => _.Student.Equals(student));
+            var existingScore = Scores.First(_ => _.Student.Equals(student));
             existingScore.AddScore(score);
         }

[Killed] Linq method mutation (FirstOrDefault() to First())
Scoreboard.cs:25:20
 
         public int GetScore(Student student)
         {
-            return Scores.Where(_ => _.Student.Equals(student))
-                .Select(_ => _.Score)
-                .FirstOrDefault();
+            return Scores.Where(_ => _.Student.Equals(student))
+                .Select(_ => _.Score)
+                .First();
         }
     }
