[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
StudentScore.cs:16:13
 
         public void AddScore(int score)
         {
-            Score += score;
+                        Score -=score;
         }
     }
