[Killed] Logical mutation
StudentValidator.cs:7:20
     {
         public static bool IsValid(Student student)
         {
-            return student.Age >= 18 && student.HasPaid;
+            return student.Age >= 18 || student.HasPaid;
         }
     }

[Killed] Equality mutation
StudentValidator.cs:7:20
     {
         public static bool IsValid(Student student)
         {
-            return student.Age >= 18 && student.HasPaid;
+            return student.Age > 18  && student.HasPaid;
         }
     }
